app/Controllers/LineasTelefonicasController.php

SELECT *
FROM `lineas_telefonicas`
---
    public function index(): string
    {
        $linea = new LineasTelefonicasModel();
        $datos['datos']=$linea->findAll();

DELETE FROM `lineas_telefonicas`
WHERE `no_telefono` IN ('41407316')
---
    public function eliminarLinea($id=null)
    {
        $lineas = new LineasTelefonicasModel();
        $lineas->delete(['no_telefono'=>$id]);

SELECT *
FROM `lineas_telefonicas`
WHERE `no_telefono` = '41407115'
 LIMIT 1
---
    public function buscarLinea($id=null){
        $lineas = new LineasTelefonicasModel();
        $datos['datos']=$lineas->where('no_telefono',$id)->first();