app/Controllers/PlanesController.php

SELECT *
FROM `planes`
---
    public function index(): string
    {
        $plan = new PlanesModel();
        $datos['datos']=$plan->findAll();

SELECT *
FROM `planes`
WHERE `plan_id` = '7'
 LIMIT 1
---
    public function buscarPlan($id=null){
        //echo "codigo: ".$id;
        $planes = new PlanesModel();
        //select * from planes where plan_id=$id;
        $datos['datos']=$planes->where('plan_id',$id)->first();